Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.GetCustomConnectionTemplateDataHash(System.String@)
Gets binary custom connection template data hash.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.SetCustomConnectionTemplateData(System.IntPtr,System.Int32,System.String,System.Guid)
Sets binary data related to custom connection template.
data:
Custom connection template data.
nDataSize:
Data size.
hash:
Custom connection template data hash.
id:
Unique id of the template.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.UpdateCustomConnectionType(Autodesk.Revit.DB.Structure.StructuralConnectionHandler,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference},System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Modifies StructuralConnectionHandlerType of input StructuralConnectionHandler.
Adds input elements or subelements.
Removes input subelements.The subelements will be erased.
Updates any geometrical, parametrical or location changes of existing subelements, regardless of whether elements or subelements are added or removed.
Remarks:
Elements or subelements added to a custom connection are deleted and transformed in subelements of the connection. They could be:
FamilyInstance (structural beams and columns).StructuralConnectionHandler elements associated to the connection.Specific steel connection elements (bolts, anchors, plates, etc). These connection elements will be of type element but with categories related to structural connections, for example:
OST_StructConnectionWeldsOST_StructConnectionHolesOST_StructConnectionModifiersOST_StructConnectionShearStudsOST_StructConnectionBoltsOST_StructConnectionAnchorsOST_StructConnectionPlates
You cannot add: elements connected by any connection handler, generic connections, holes and modifiers that are not on the connected elements.
structuralConnectionHandler:
The existing StructuralConnectionHandler having custom StructuralConnectionHandlerType which is about to be modified.
addReferences:
References to elements or subelements which are to be used to modify custom StructuralConnectionHandlerType by adding them.
removeReferences:
References to subelements of input StructuralConnectionHandler which are to be used to modify custom StructuralConnectionHandlerType by removing them.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Input StructuralConnectionHandler must have custom type.
-or-
All the input Elements should be of the following structural categories: framings, columns, profiles, plates, bolts, anchors, shear studs, welds or structural connections.
-or-
Total number of different input elements of input StructuralConnectionHandlers must be lower or equal to 3.
-or-
All the input references must belong to input StructuralConnectionHandler.
After modification of StructuralConnectionHandlerType there must remain at least one subelement of structural connections category in StructuralConnectionHandler.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017